{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[UNK]": 0,
      "[BOS]": 1,
      "[EOS]": 2,
      "[PAD]": 3,
      "-": 4,
      "0": 5,
      "1": 6,
      "2": 7,
      "3": 8,
      "4": 9,
      "5": 10,
      "6": 11,
      "7": 12,
      "8": 13,
      "9": 14,
      "10": 15,
      "11": 16,
      "12": 17,
      "13": 18,
      "14": 19,
      "15": 20,
      "16": 21,
      "17": 22,
      "18": 23,
      "19": 24,
      "20": 25,
      "21": 26,
      "22": 27,
      "23": 28,
      "24": 29,
      "25": 30,
      "26": 31,
      "27": 32,
      "28": 33,
      "29": 34,
      "30": 35,
      "31": 36,
      "33": 37,
      "32": 38,
      "34": 39,
      "36": 40,
      "37": 41,
      "35": 42,
      "38": 43,
      "39": 44,
      "41": 45,
      "42": 46,
      "43": 47,
      "40": 48,
      "44": 49,
      "46": 50,
      "45": 51,
      "48": 52,
      "49": 53,
      "50": 54,
      "53": 55
    },
    "merges": [
      [
        "1",
        "0"
      ],
      [
        "1",
        "1"
      ],
      [
        "1",
        "2"
      ],
      [
        "1",
        "3"
      ],
      [
        "1",
        "4"
      ],
      [
        "1",
        "5"
      ],
      [
        "1",
        "6"
      ],
      [
        "1",
        "7"
      ],
      [
        "1",
        "8"
      ],
      [
        "1",
        "9"
      ],
      [
        "2",
        "0"
      ],
      [
        "2",
        "1"
      ],
      [
        "2",
        "2"
      ],
      [
        "2",
        "3"
      ],
      [
        "2",
        "4"
      ],
      [
        "2",
        "5"
      ],
      [
        "2",
        "6"
      ],
      [
        "2",
        "7"
      ],
      [
        "2",
        "8"
      ],
      [
        "2",
        "9"
      ],
      [
        "3",
        "0"
      ],
      [
        "3",
        "1"
      ],
      [
        "3",
        "3"
      ],
      [
        "3",
        "2"
      ],
      [
        "3",
        "4"
      ],
      [
        "3",
        "6"
      ],
      [
        "3",
        "7"
      ],
      [
        "3",
        "5"
      ],
      [
        "3",
        "8"
      ],
      [
        "3",
        "9"
      ],
      [
        "4",
        "1"
      ],
      [
        "4",
        "2"
      ],
      [
        "4",
        "3"
      ],
      [
        "4",
        "0"
      ],
      [
        "4",
        "4"
      ],
      [
        "4",
        "6"
      ],
      [
        "4",
        "5"
      ],
      [
        "4",
        "8"
      ],
      [
        "4",
        "9"
      ],
      [
        "5",
        "0"
      ],
      [
        "5",
        "3"
      ]
    ]
  }
}